title: Okta Policy Modified or Deleted
name: Always optional
id: 12a1cc2a-b11f-4fe2-b3e0-8515e5570f8e
description: Detects when an Okta policy is modified or deleted.
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
author: dogesec tests
date: 2020-01-01
modified: 2023-12-25
tags:
    - tlp.clear
    - attack.t1547
    - attack.t1671
    - attack.t1025
    - attack.command-and-control
    - attack.credential_access # not sigma spec format, but still supported
    - cve.2025-12325
    - attack.t1661 # will fail is mobile
    - custom.tag
logsource:
    product: okta
    service: okta
    category: login
    definition: Logging must be enabled.
detection:
    selection:
        eventtype:
            - policy.lifecycle.update
            - policy.lifecycle.delete
    condition: selection
falsepositives:
    - Okta Policies being modified or deleted may be performed by a system administrator.
    - Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.
    - Okta Policies modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule.
fields: 
    - sourceIPAddress
    - userIdentity.arn
scope:
    - server
status: deprecated
level: low
license: MIT