title: Attack Navigator Mobile
id: 35e2d9cc-cba1-41d5-a911-3d5dd29d0006
status: test
description: Build an Attack Mobile Navigator layer
references:
    - https://www.dogesec.com
author: dogesec
date: 2020-01-01
modified: 2020-01-02
tags:
    - tlp.clear
    - attack.t1661
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype:
            - policy.lifecycle.update
            - policy.lifecycle.delete
    condition: selection
level: low
license: MIT