title: Attack Navigator ICS
id: c2e3c476-ad62-430c-9444-d495a66691d1
status: test
description: Build an Attack ICS Navigator layer
references:
    - https://www.dogesec.com
author: dogesec
date: 2020-01-01
modified: 2020-01-02
tags:
    - tlp.clear
    - attack.t0800
logsource:
    product: okta
    service: okta
detection:
    selection:
        eventtype:
            - policy.lifecycle.update
            - policy.lifecycle.delete
    condition: selection
level: low
license: MIT